app/views/users/show.html.erb

SELECT `events`.* FROM `events` WHERE (`events`.user_id = 1)
---

<% @user.events.each do |f| %>