app/controllers/users_controller.rb

  def index
    @users = User.search(params[:search]).paginate(:per_page => 10, :page => params[:page])
---
SELECT `users`.* FROM `users` WHERE (name LIKE '%%' OR email LIKE '%%' OR artist_name LIKE '%%') LIMIT 10 OFFSET 0

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`arts_type`, `photo_file_size`, `updated_at`, `band`, `photo_file_name`, `photo_updated_at`, `facebook`, `username`, `artist_name`, `password_salt`, `ind_group`, `fname`, `bio`, `lname`, `password_hash`, `youTube`, `photo_content_type`, `teacher`, `zip`, `name`, `email`, `twitter`, `web_site`, `user_type`, `created_at`) VALUES ('Other', 162128, '2011-08-21 01:38:28', NULL, 'IMG_0066.JPG', '2011-08-21 01:38:27', 'benhall2121', NULL, 'Benerino', '$2a$10$lFk.9eIryOkOYsbqTTIrie', NULL, NULL, 'Yeah', NULL, '$2a$10$lFk.9eIryOkOYsbqTTIrieKApFkSDHWrJBSJ7ud.1vvYOA7lg5l0S', 'benhall2121', 'image/jpeg', NULL, NULL, 'Ben Hall', 'be@yahoo.com', 'benhall2121', 'http://www.benerino.com', NULL, '2011-08-21 01:38:28')

  def update
    @user = current_user
    if @user.update_attributes(params[:user])
---
UPDATE `users` SET `artist_name` = 'Benerino', `twitter` = 'http://www.twitter.com/benhall2121', `ind_group` = 'Individual', `arts_type` = 'Programming', `name` = 'Ben Hall', `facebook` = 'http://www.facebook.com/benhall2121', `bio` = 'I am awesome!', `updated_at` = '2011-08-20 17:28:09' WHERE `users`.`id` = 1

  def donate_paypal
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1